export default {
    tips: [
        [
            "奇了个大谱",
            "奇谱他妈给奇谱开门奇谱到家了",
            "奇谱发生器是Phigros自制谱界最好用的制谱器，每天不写30个奇谱就会有300条判定线在我身上爬",
            "地球是太空中最好的行星，每天住在地球上，就是有101个奇谱发生器在我身上爬",
            "你说得对，但是奇谱发生器是由Zes Minkey Young自主研发的一款制谱器，后面的忘了",
            "本制谱器没有使用lchzh3473的sim-phi制作",
            "制谱器一定要有谱面✍✍✍✍✍✍✍✍",
            "[露出了6号缓动]",
            "本软件是“奇谱发生器”，不是“八股谱发生器”更不是“粪谱发生器”",
            "奇谱发生器我爱你。饮水机我爱你。李纯真我爱你。欢乐牧场我爱你。娜奇我爱你。百零六我爱你。Sildild我爱你。",
            "https://pgrfm.miraheze.org/为本软件的官方网站",
            "想出“奇谱发生器”这名字的家里得请启普了"
        ],
        [
            "撤销重做、复制粘贴不需要Ctrl，直接按Z/Y/C/V即可",
            "写拆线表演的话，为拆下来的线创建一个判定线组，会有惊喜哦",
            "判定线组可以在次侧栏的判定线信息编辑器编辑。次侧栏顶部可以控制当前显示哪个次侧栏。",
            "若当前位于非数值性事件序列，“封装”按钮不会显示",
            "只有已经有子线的判定线才能直接在麾下创建子线。否则，您需要将已有的判定线设为它的子线。",
            "按两下“切换”键可以进入用户脚本编辑器，可以用JavaScript来写谱哦，最好在VSCode里写了再复制过来",
            "如果有Git的话，可以在server/config.json里启用版本控制，这样谱面会保存到Git里",
            "KPAJSON本质上还是RPEJSON改的，点“编译”可以生成RPEJSON"
        ],
        [
            "奇铺发生器再打广告我给你ban了",
            "啊啊啊作者你的下载地址在哪里啊啊啊啊",
            "此软件的真实性存疑，请谨慎甄别",
            "RPE=唯一真神，KPA=我不知道怎么用"
        ],

        [
            "能不去参考别人现成的结构，实现自己的创意，这本身就很值得鼓励，我不可能去攻击这样的创作者"
        ],

        [
            "男人只是在Hold里塞了100个Tap，就被Phira审核活活打断了双腿",
            "2573 + 30 ^ 2 = 3473"
        ],

        [
            "天苍苍，野茫茫，风吹草低见牛羊",
            "闊靛緥婧愮偣",
            "至此，，，，",
            "国王的船员们说阿门",
            "一觉醒来，全世界制谱水平下降1%，而你不变",
            "我-我-要-要-投-诉-你！",
            "横眉冷对千夫指，俯首甘为孺子牛",
            "地球将被陨石撞，太空舞线准备好。死亡钟声已敲响，但是舞线绝对不会怕。舞线加油！",
            "引导🗺线🧵是一看👀非常🔝有趣😍的音乐🎵节奏🎶游戏🎮，游戏🎮引导🗺线🧵(Max🔝Line🧵)内⤵️拥有☑️超多🔢音乐🎵资源和各种🔣难度的关卡🆒，玩家👤可以自由😇挑战各种🔣关卡，跟随节奏🎶完美完成挑战。引导🗺线🧵(Max🔝Line🧵)的乐曲🎵非常多，玩家👤需要通过跟着🚶节奏🎶点击👆屏幕，控制🎮线条🧵转向⤴️，避开✖️障碍物◼️来通过🚶关卡。引导🗺线🧵(Max🔝Line🧵)最新版🆕采用的是比较精美🎨的颜色🌈主题风格，而且玩法🎮丰富程度要高于🔝原版😉"
        ],

        [
            "比起模板缓动，我更喜欢你！"
        ],

        [
            "美食大赛是一款快速高效的JavaScript运行时",
            "新的 可扩展标记语言超文本传输协议请求 括弧",
            "Error: Cannot create an instance of abstract class 'Fruit' at line 3 '我不吃苹果和香蕉，医生让我吃水果'",
            "讲个笑话：睡眠排序的时间复杂度是O(N)"
        ],

        [
            "玩诶喝沸诗俺会生辉",
            "半罐水响叮当，一罐水响叮叮当当",
            "十二年寒窗苦读，曾经那个弱不禁风的小男孩已经长成了一个弱不禁风的大男孩",
            "沉默是金，晚的康桥",
            "面包的价格是50万马克，所以你选择钝角，并将答案标在试卷上",
            "化学老师发出了尖锐的爆鸣声",
            "把你故事的参考文献讲出来，看看是不是在出版社里面。你昨天在这里输出日志，只有你猜中考题是二分查找",
            "好的菜会被下架吗？好的老师会被开除吗？好的话会被擦掉吗？会吗？会吗？",
            "20岁吃过砒霜，现在已经18岁了",
            "对手使用了电石，你的启普发生器爆炸了",
            "从今天起，做一个幸福的人，劈马，喂柴，周游世界",
            "不积极阅读乐学学术力作",
            "运动降低人到封建礼教的能量传递效率",
            "Taq酶会解决问题的"
        ],

        ["你说的对，但是《Air Ticket Extend》是由SWORDNEW...SWORDGAME.EXE自主研发的一款文字剧情冒险游戏，中间的忘了，揭开『科学』『魔法』的真相。"],

    ].flat(),
    TIP_INTERVAL: 10_000
}